Revit 2016 API
BuiltInFailures.LoadFailures Properties
The BuiltInFailures.LoadFailures type exposes the following members.
Properties
Name | Description
CannotCopyHostedLoad
 Can't copy Load based on the Host Element.
CannotMirrorHostedLoad
 Can't mirror Load based on the Host Element.
CannotMirrorLoad
 Can't mirror Load because mirror plane is not perpendicular to sketch plane.
CannotRotateLoad
 Can't rotate Load because rotation axis is not perpendicular to sketch plane.
LineLoadAllZero
 Line Load can't have all force components and moment components to be zero.
PointLoadAllZero
 Point Load can't have all force components and moment components to be zero.
See Also
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace